{"pageProps":{"postData":{"id":"android-emulator-apple-silicon","contentHtml":"<p>Bonsoir à tous!</p>\n<p>J'ai récemment craqué pour le nouveau MacBook Pro M1! Depuis 1 semaine que je l'apprivoise, toutes les applications\nque j'utilise fonctionnent (merci Rosetta2!). Mon seul problème, en tant que developpeur mobile, est que l'Emulateur\nAndroid ne fonctionne pas. C'est\nd'ailleurs le problème de toutes les applications qui font de la virtualisation (Docker, ParallelDesktop, etc …)!\nJe dois donc utiliser un téléphone physique, et cela m'empêche de tester mes applications sur différentes versions\nd'Android.</p>\n<p>Heureusement les ingénieurs de Google sont à fond sur le  coup et ont mis à disposition une version Preview de\nl'émulateur ici : <a href=\"https://androidstudio.googleblog.com/2020/12/android-emulator-apple-silicon-preview.html\">https://androidstudio.googleblog.com/2020/12/android-emulator-apple-silicon-preview.html</a></p>\n<p>Et ça fonctionne :</p>\n<p><img src=\"/static/images/post/capture_android_emulator_preview.png\" alt=\"Capture Android preview\"></p>\n<p>Pour autant tout n'est pas parfait :</p>\n<ul>\n<li>Les Webview ne fonctionnent pas</li>\n<li>Pas de son</li>\n<li>Pas de skin téléphone</li>\n<li>Les codecs vidéos ne sont pas fonctionnels</li>\n<li>Les applications ARM 32Bits ne sont pas compatibles</li>\n<li>Quelques bugs graphiques sur les applications utilisant l'API Vulkan</li>\n<li>Une popup apparait au démarrage de l'émulateur, indiquant qu'elle ne trouve pas ADB</li>\n</ul>\n<p>Tout est dit! Il ne reste plus qu'à tester 😃.</p>\n<p>Amusez-vous bien!</p>\n","author":"giboow","title":"Android Emulator sur Apple Silicon, enfin une preview!","date":"2020-12-06","keywords":["Android","Android Emulator","Apple Silicon","AppleM1"],"image":"/static/images/post/android-apple.png","summary":"J'ai récemment craqué pour le nouveau MacBook Pro M1! Depuis 1 semaine que je l'apprivoise, toutes les applications que j'utilise fonctionnent (merci Rosetta2!). Mon seul problème, en tant que developpeur mobile, est que l'Emulateur Android ne fonctionne pas","readingTime":1}},"__N_SSG":true}