{"pageProps":{"postData":{"id":"comment-configurer-postgresql-avec-pgtune","contentHtml":"<p>Récemment, j'ai dû mettre le nez dans les serveurs de notre application, car nous avions des problèmes de performances\net de stabilité.</p>\n<p>Pour vous replanter le décor, l'application dont je m'occupe aujourd'hui est hébergé sur un serveur qui comprend un\nservice de base de données Postgres, un serveur d'application Java, ainsi que d'un serveur apache permettant aux\nutilisateurs de télécharger le front. Tout ça fonctionne sur le même serveur sans conteneurs. N'ayant pas installé ces\nservices moi-même, j'ai dû passer un peu de temps pour comprendre pourquoi notre serveur plantait lors de fortes\ncharges... Puis je me suis aperçu grâce à notre système de monitoring que la mémoire du serveur Postgres n'était même\npas limitée...</p>\n<p>Je n'ai aucune connaissance sur les configurations des services Postgres, et comme je n'aime pas trop perdre de temps à\néplucher les documentations, j'ai fouillé un peu sur la toile. C'est là que j'ai découvert le travail\nde <a href=\"https://github.com/le0pard\">Alexey Vasiliev (@leOpard)</a> qui propose un générateur de configuration\nPostgres : <a href=\"https://pgtune.leopard.in.ua/#/\">PGTune</a></p>\n<p>Il suffit de paramétrer votre configuration en fonction des ressources que vous voulez allouer sur le serveur! Et PAF ça\nfait le ☕!</p>\n<p><img src=\"/static/images/post/capture-pgtune.png\" alt=\"PGTune capture\"></p>\n<p>Il ne vous reste plus qu'à injecter cette nouvelle configuration dans le fichier de configuration de votre Postgres.</p>\n<p>Depuis que j'ai appliqué la configuration par l'utilitaire, je n'ai plus de problème de performance. Finalement, les utilisateurs sont\ncontents, et moi aussi 😃.</p>\n<p>Pour les fans de <a href=\"https://www.ruby-lang.org/fr/\">Ruby</a>, où si cela vous amuse, vous pouvez aller consulter le code du\ngénérateur de @leOpard, les sources sont disponibles sur\nGithub : <a href=\"https://github.com/le0pard/pgtune\">https://github.com/le0pard/pgtune</a></p>\n","author":"giboow","title":"Comment bien configurer son serveur Postgres avec PGTune","date":"2020-12-02","keywords":["Postgresql","Tunning","Performances"],"image":"/static/images/post/pgtune.png"}},"__N_SSG":true}